---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.PathReinAltOffset
source: html/81fcd801-a0da-fa4f-6267-87f515c1998f.htm
---
# Autodesk.Revit.DB.ParameterTypeId.PathReinAltOffset Property

"Alternating Bar - Offset"

## Syntax (C#)
```csharp
public static ForgeTypeId PathReinAltOffset { get; }
```